Revit 2027 API
PDFExportOptions.PaperPlacement Property
 Paper placement of either center or offset from corner.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PaperPlacementType PaperPlacement { get; set; }
Public Property PaperPlacement As PaperPlacementType
	Get
	Set
public:
property PaperPlacementType PaperPlacement {
	PaperPlacementType get ();
	void set (PaperPlacementType value);
}
member PaperPlacement : PaperPlacementType with get, set
Property Value
PaperPlacementType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace